### Q1. List any five functions of the pandas library with execution.

#### Functions of Pandas 

* df.Describe()

* df.value_counts()

* df.head()

* df.tail()

* df.info()

In [1]:
import pandas as pd

In [2]:
df =pd.read_csv(r"C:\Users\Sanju\Materials for Data Science\My notes For Python\Pandas & numpy\nba.csv")

In [3]:
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

#### Describe - It gives the staticstical values of the dataset, to find the mean, median, standard deviation etc

In [4]:
df.describe()

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

#### Value_Counts - This function provides you the count of unique values present inside the column

In [5]:
df.value_counts("Team")

Team
New Orleans Pelicans      19
Memphis Grizzlies         18
New York Knicks           16
Milwaukee Bucks           16
Atlanta Hawks             15
Utah Jazz                 15
Toronto Raptors           15
San Antonio Spurs         15
Sacramento Kings          15
Portland Trail Blazers    15
Phoenix Suns              15
Philadelphia 76ers        15
Oklahoma City Thunder     15
Boston Celtics            15
Miami Heat                15
Los Angeles Lakers        15
Los Angeles Clippers      15
Indiana Pacers            15
Houston Rockets           15
Golden State Warriors     15
Detroit Pistons           15
Denver Nuggets            15
Dallas Mavericks          15
Cleveland Cavaliers       15
Chicago Bulls             15
Charlotte Hornets         15
Brooklyn Nets             15
Washington Wizards        15
Minnesota Timberwolves    14
Orlando Magic             14
dtype: int64

#### Head - This function will provide you the first five records of dataset

In [6]:
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

#### Tail - This function will provide the last five records ofhe dataset

In [7]:
df.tail()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

#### Info - This function provide the information of each columns about is datatypes, total no. of columns, memory usage and Non - null count

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row

In [9]:
data = pd.DataFrame({"A":["apple", "banana", "cucumber"],
                    "B":[45,33,22],
                    "C":["Moderate sweet", "sweet", "Low sweet"]})

In [10]:
new_index=pd.RangeIndex(start = 1, stop = len(data)*2, step = 2)

In [11]:
new_df = data.set_index(new_index)

In [12]:
new_df

          A   B               C
1     apple  45  Moderate sweet
3    banana  33           sweet
5  cucumber  22       Low sweet

#### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should 
calculate and print the sum of the first three values, which is 60

In [13]:
def sum_of_three(df,a):
    values = df["Values"][:a]
    
    print(sum(values))

In [14]:
df = pd.DataFrame({'Values':[10,20,30,40,50]})

In [15]:
sum_of_three(df,3)

60

#### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column

In [16]:
df1 = pd.DataFrame({"Text": ["Python","Data Science", "Machine Learning", "Artificial Inteligence"]})

In [17]:
df1["Word_count"] = df1["Text"].str.split().str.len()

In [18]:
df1

                     Text  Word_count
0                  Python           1
1            Data Science           2
2        Machine Learning           2
3  Artificial Inteligence           2

#### Q5. How are DataFrame.size() and DataFrame.shape() different?

`DataFrame.size()` - It provide the total number of elements present inside the array.

`DataFrame.shape()` - It provide the total number of rows and columns in a tuple.

#### Q6. Which function of pandas do we use to read an excel file?

For reading excel files, Pandas has function called `pd.read_excel()` it helps to read the excel files.

#### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [19]:
df = pd.DataFrame({"Email":["sanju@domain.com", "python@domain.com", "machinelearning@domain.com"]})

In [20]:
df["Username"] = df["Email"].str.split('@').str[0]

In [21]:
df

                        Email         Username
0            sanju@domain.com            sanju
1           python@domain.com           python
2  machinelearning@domain.com  machinelearning

#### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows

In [22]:
df= pd.DataFrame({"A":[3,8,6,2,9],
                 "B":[5,2,9,3,1],
                 "C":[1,7,4,5,2]})

In [23]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [24]:
df1 = df.iloc[1:-3,:].copy()

In [25]:
df2 = df.iloc[4:,:].copy()

In [26]:
new_df = pd.concat([df1,df2])

In [27]:
new_df

   A  B  C
1  8  2  7
4  9  1  2

#### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column

In [28]:
df = pd.DataFrame({'Values': [10,20,30,40,40,50]})

In [29]:
mean = df["Values"].mean()

median = df["Values"].median()

Std = df["Values"].std()


print(f"The Mean is {mean}")

print(f"The Median is {median}")

print(f"The Standard_deviation is {Std}")

The Mean is 31.666666666666668
The Median is 35.0
The Standard_deviation is 14.719601443879746

#### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day

In [30]:
date = pd.date_range(start = '2023-04-05', periods = 8)

In [31]:
df = pd.DataFrame({"Sales": [140, 200, 250, 180, 130, 87, 90, 95], "Date": date})

In [32]:
df["Moving_avg"] = df.rolling(window = 7)["Sales"].mean()

In [33]:
df

   Sales       Date  Moving_avg
0    140 2023-04-05         NaN
1    200 2023-04-06         NaN
2    250 2023-04-07         NaN
3    180 2023-04-08         NaN
4    130 2023-04-09         NaN
5     87 2023-04-10         NaN
6     90 2023-04-11  153.857143
7     95 2023-04-12  147.428571

#### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column

In [34]:
df = pd.DataFrame({"Date":["2023-01-01", "2023-01-02", "2023-01-03", "2023-01-04", "2023-01-05", "2023-01-06", "2023-01-07"]})

In [35]:
df["Weekday"] = ["Sunday", "Monday", "Tuesday", "Wednesday", 'Thursday', "Friday", "Saturday"]

In [36]:
df

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday
5  2023-01-06     Friday
6  2023-01-07   Saturday

#### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [39]:
df = pd.DataFrame({"Date": pd.date_range(start = "2023-01-01", end = "2023-02-10", freq= "d")})

df1 = pd.Timedelta(hours = 7, minutes = 54)

new_df = df + df1

Start_date = "2023-01-01"

end_date = "2023-02-01"

updated_df = (new_df["Date"]>=Start_date) & (new_df["Date"]<=end_date)

Filtered_df= new_df.loc[updated_df]

Filtered_df

                  Date
0  2023-01-01 07:54:00
1  2023-01-02 07:54:00
2  2023-01-03 07:54:00
3  2023-01-04 07:54:00
4  2023-01-05 07:54:00
5  2023-01-06 07:54:00
6  2023-01-07 07:54:00
7  2023-01-08 07:54:00
8  2023-01-09 07:54:00
9  2023-01-10 07:54:00
10 2023-01-11 07:54:00
11 2023-01-12 07:54:00
12 2023-01-13 07:54:00
13 2023-01-14 07:54:00
14 2023-01-15 07:54:00
15 2023-01-16 07:54:00
16 2023-01-17 07:54:00
17 2023-01-18 07:54:00
18 2023-01-19 07:54:00
19 2023-01-20 07:54:00
20 2023-01-21 07:54:00
21 2023-01-22 07:54:00
22 2023-01-23 07:54:00
23 2023-01-24 07:54:00
24 2023-01-25 07:54:00
25 2023-01-26 07:54:00
26 2023-01-27 07:54:00
27 2023-01-28 07:54:00
28 2023-01-29 07:54:00
29 2023-01-30 07:54:00
30 2023-01-31 07:54:00

#### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported

In [40]:
import pandas as pd